.svn/pristine/41/4164c079861d87bd67f585e7e96cd03e8d1f78dc.svn-base

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions targetNamespace="http://premiumwrapper.motor.itgi.com" xmlns:apachesoap="http://xml.apache.org/xml-soap" xmlns:impl="http://premiumwrapper.motor.itgi.com" xmlns:intf="http://premiumwrapper.motor.itgi.com" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
<!--WSDL created by Apache Axis version: 1.4
Built on May 13, 2010 (11:31:29 IST)-->
 <wsdl:types>
  <schema elementFormDefault="qualified" targetNamespace="http://premiumwrapper.motor.itgi.com" xmlns="http://www.w3.org/2001/XMLSchema">
   <element name="getVehicleIdv">
    <complexType>
     <sequence>
      <element name="idvWebServiceRequest" type="impl:IDVWebServiceRequest"/>
     </sequence>
    </complexType>
   </element>
   <complexType name="IDVWebServiceRequest">
    <sequence>
     <element name="dateOfRegistration" nillable="true" type="xsd:string"/>
     <element name="inceptionDate" nillable="true" type="xsd:string"/>
     <element name="makeCode" nillable="true" type="xsd:string"/>
     <element name="rtoCity" nillable="true" type="xsd:string"/>
    </sequence>
   </complexType>
   <element name="getVehicleIdvResponse">
    <complexType>
     <sequence>
      <element name="getVehicleIdvReturn" type="impl:IDVWebServiceResponse"/>
     </sequence>
    </complexType>
   </element>
   <complexType name="IDVWebServiceResponse">
    <sequence>
     <element name="erorMessage" nillable="true" type="xsd:string"/>
     <element name="idv" nillable="true" type="xsd:decimal"/>
     <element name="maximumIdvAllowed" nillable="true" type="xsd:decimal"/>
     <element name="minimumIdvAllowed" nillable="true" type="xsd:decimal"/>
    </sequence>
   </complexType>
  </schema>
 </wsdl:types>

   <wsdl:message name="getVehicleIdvRequest">

      <wsdl:part element="impl:getVehicleIdv" name="parameters">

      </wsdl:part>

   </wsdl:message>

   <wsdl:message name="getVehicleIdvResponse">

      <wsdl:part element="impl:getVehicleIdvResponse" name="parameters">

      </wsdl:part>

   </wsdl:message>

   <wsdl:portType name="IDVWebService">

      <wsdl:operation name="getVehicleIdv">

         <wsdl:input message="impl:getVehicleIdvRequest" name="getVehicleIdvRequest">

       </wsdl:input>

         <wsdl:output message="impl:getVehicleIdvResponse" name="getVehicleIdvResponse">

       </wsdl:output>

      </wsdl:operation>

   </wsdl:portType>

   <wsdl:binding name="IDVWebServiceSoapBinding" type="impl:IDVWebService">

      <wsdlsoap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>

      <wsdl:operation name="getVehicleIdv">

         <wsdlsoap:operation soapAction=""/>

         <wsdl:input name="getVehicleIdvRequest">

            <wsdlsoap:body use="literal"/>

         </wsdl:input>

         <wsdl:output name="getVehicleIdvResponse">

            <wsdlsoap:body use="literal"/>

         </wsdl:output>

      </wsdl:operation>

   </wsdl:binding>

   <wsdl:service name="IDVWebServiceService">

      <wsdl:port binding="impl:IDVWebServiceSoapBinding" name="IDVWebService">

         <wsdlsoap:address location="http://220.227.8.74/portaltest/services/IDVWebService"/>

      </wsdl:port>

   </wsdl:service>

</wsdl:definitions>
