resource/request_file/IffcoTokio_Car_IDV.xml

<?xml version="1.0" encoding="utf-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:prem="http://premiumwrapper.motor.itgi.com">
    <soapenv:Header/>
    <soapenv:Body>
        <prem:getVehicleIdv>
            <prem:idvWebServiceRequest>
                <prem:dateOfRegistration>___vehicle_registration_date___</prem:dateOfRegistration>
                <prem:inceptionDate>___policy_start_date___ 00:00:00</prem:inceptionDate>
                <prem:makeCode>___product_id___-___dbmaster_insurer_vehicle_make_code___-___vehicle_manf_year___</prem:makeCode>
                <prem:rtoCity>___dbmaster_insurer_rto_city_code___</prem:rtoCity>
            </prem:idvWebServiceRequest>
        </prem:getVehicleIdv>
    </soapenv:Body>
</soapenv:Envelope>
